docs/2016/emacs-python-gnupack-setting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-09-17 Thu 12:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>emacs 24 で Python の環境を作る</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">emacs 24 で Python の環境を作る</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org45bf647">1. 環境</a></li>
<li><a href="#org7a28346">2. python</a></li>
<li><a href="#org1416658">3. easy<sub>install</sub></a></li>
<li><a href="#orgcd8fc63">4. pip</a></li>
<li><a href="#org38f4e80">5. virtualenv</a></li>
<li><a href="#orge7cfce8">6. PEP8</a></li>
<li><a href="#orgf527bed">7. pyflakes</a></li>
<li><a href="#orgac32bae">8. jedi</a></li>
<li><a href="#org43ec511">9. 参考</a></li>
</ul>
</div>
</div>
<div id="outline-container-org45bf647" class="outline-2">
<h2 id="org45bf647"><span class="section-number-2">1</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Windows 7 64bit</li>
<li>gnupack<sub>devel</sub>-13.06-2015.11.08
<ul class="org-ul">
<li>binutils 2.25-4</li>
<li>libuuid-devel 2.25.2-2</li>
</ul></li>
<li>GNU Emacs 24.5.1 (i686-pc-cygwin) of 2015-11-08 on gnupack</li>
<li>Python 2.7.10
<ul class="org-ul">
<li>python-setuptools 15.2-1</li>
<li>easy<sub>install</sub> 2.7</li>
<li>pip 8.1.1 from /usr/lib/python2.7/site-packages/pip-8.1.1-py2.7.egg (python 2.7)
<ul class="org-ul">
<li>apipkg==1.4</li>
<li>autopep8==1.2.2</li>
<li>epc==0.0.5</li>
<li>execnet==1.4.1</li>
<li>jedi==0.9.0</li>
<li>pbr==1.8.1</li>
<li>pep8==1.7.0</li>
<li>py==1.4.31</li>
<li>pyflakes==1.1.0</li>
<li>pytest==2.9.1</li>
<li>pytest-cache==1.0</li>
<li>pytest-pep8==1.0.6</li>
<li>sexpdata==0.0.3</li>
<li>six==1.10.0</li>
<li>stevedore==1.12.0</li>
<li>virtualenv==15.0.1</li>
<li>virtualenv-clone==0.2.6</li>
<li>virtualenvwrapper==4.7.1</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org7a28346" class="outline-2">
<h2 id="org7a28346"><span class="section-number-2">2</span> python</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">$ apt-cyg install python
$ python --version
Python 2.7.10
</pre>
</div>
<p>
emacs で python を快適に使用するために、python-mode を入れる。
</p>
<pre class="example">
M-x package-install python-mode
</pre>
<p>
init.el の設定は以下のとおり。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'python-mode-hook
                   '(lambda ()
                        (<span style="color: #0000FF;">setq</span> indent-tabs-mode nil)
                        (<span style="color: #0000FF;">setq</span> indent-level 4)
                        (<span style="color: #0000FF;">setq</span> python-indent 4)
                        (<span style="color: #0000FF;">setq</span> tab-width 4)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1416658" class="outline-2">
<h2 id="org1416658"><span class="section-number-2">3</span> easy<sub>install</sub></h2>
<div class="outline-text-2" id="text-3">
<p>
python のパッケージ管理ツール。python-setuptools の中に入っている。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ apt-cyg install python-setuptools
$ easy_install-2.7 --version
setuptools 15.2
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd8fc63" class="outline-2">
<h2 id="orgcd8fc63"><span class="section-number-2">4</span> pip</h2>
<div class="outline-text-2" id="text-4">
<p>
easy<sub>install</sub> の強化版。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ apt-cyg install binutils libuuid-devel
$ easy_install-2.7 pip
$ pip --version
pip 8.1.1 from /usr/lib/python2.7/site-packages/pip-8.1.1-py2.7.egg (python 2.7)
</pre>
</div>
</div>
</div>

<div id="outline-container-org38f4e80" class="outline-2">
<h2 id="org38f4e80"><span class="section-number-2">5</span> virtualenv</h2>
<div class="outline-text-2" id="text-5">
<p>
プロジェクト毎に仮想環境を作れるツール。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ easy_install-2.7 virtualenv
$ easy_install-2.7 virtualenvwrapper
$ source virtualenvwrapper.sh
$ export <span style="color: #BA36A5;">WORKON_HOME</span>=~/.virtualenvs
$ virtualenv --version
15.0.1
</pre>
</div>
<p>
例えば次のように使う。~/.virtualenvs/myproject を仮想環境用ディレクトリとして、cherrypy を入れている。不要になったら、削除して終り。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ mkdir -p ~/.virtualenvs/myproject
$ cd ~/.virtualenvs/myproject
$ virtualenv .
$ source bin/activate
$ pip install cherrypy
$ deactivate
$ cd ..
$ rmvirtualenv myproject
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7cfce8" class="outline-2">
<h2 id="orge7cfce8"><span class="section-number-2">6</span> PEP8</h2>
<div class="outline-text-2" id="text-6">
<p>
Python のコーディング規約 PEP8 のチェックなどを簡単にするツール群。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ pip install pep8 pytest pytest-pep8 autopep8
</pre>
</div>

<p>
pep8 は、PEP8 に準拠しているかを調べるツール。例えば、以下のように使う。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cat 2016-03-29-174409.py
import sys, os
$ pep8 2016-03-29-174409.py
2016-03-29-174409.py:1:11: E401 multiple imports on one line
</pre>
</div>

<p>
pytest-pep8 は、pep8 をより見易くしたもの。例えば、以下のように使う<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cat 2016-03-29-174409.py
import sys, os
$ py.test --pep8 2016-03-29-174409.py
============================= test session starts ==============================
platform cygwin -- Python 2.7.10, pytest-2.9.1, py-1.4.31, pluggy-0.3.1
rootdir: /home/clothoid/junk, inifile: 
plugins: pep8-1.0.6
collected 1 items 

2016-03-29-174409.py F

=================================== FAILURES ===================================
__________________________________ PEP8-check __________________________________
/home/clothoid/junk/2016-03-29-174409.py:1:11: E401 multiple imports on one line
import sys, os
          ^

=========================== 1 failed<span style="color: #0000FF;"> in</span> 0.02 seconds ===========================
</pre>
</div>

<p>
autopep8 は pep8 に準拠したものとなるように自動で直してくれるツール。例えば、以下のように使う。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cat 2016-03-29-174409.py
import sys, os
$ autopep8 2016-03-29-174409.py
import sys
import os
</pre>
</div>

<p>
pep8 を emacs から利用するために、package を入れる。
</p>
<pre class="example">
M-x package-install RET python-pep8 RET 
</pre>
<p>
そして、init.el に以下を記述
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">require</span> <span style="color: #008000;">"python-pep8"</span>)
<span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">pep8 &#12398;&#12452;&#12531;&#12473;&#12488;&#12540;&#12523;&#12497;&#12473;&#12434;&#25351;&#23450;</span>
(<span style="color: #0000FF;">defcustom</span> <span style="color: #BA36A5;">python-pep8-command</span> <span style="color: #008000;">"/usr/bin/pep8"</span>
  <span style="color: #036A07;">"PEP8 command."</span>
  <span style="color: #006FE0;">:type</span> '(file)
  <span style="color: #006FE0;">:group</span> 'python-pep8)
</pre>
</div>
<p>
python-pep8 の使い方は、例えば、2016-03-29-174409.py を開き、M-x python-pep8 とすると python-pep8 バッファに以下のように表示される。
</p>
<pre class="example">
[*python-pep8*]
===
-*- mode: python-pep8; default-directory: "~/junk/" -*-
PEP8 started at Tue Mar 29 18:01:10

pep8 --repeat /home/clothoid/junk/2016-03-29-174409.py | sort -n -t: -k2
/home/clothoid/junk/2016-03-29-174409.py:1:11: E401 multiple imports on one line

PEP8 finished at Tue Mar 29 18:01:10
===
</pre>
</div>
</div>

<div id="outline-container-orgf527bed" class="outline-2">
<h2 id="orgf527bed"><span class="section-number-2">7</span> pyflakes</h2>
<div class="outline-text-2" id="text-7">
<p>
Python の文法エラーをチェックするもの。
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install pyflakes
</pre>
</div>
<p>
pyflakes は、例えば、以下のように使う。
</p>
<div class="org-src-container">
<pre class="src src-sh">$ cat 2016-03-29-180555.py
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/env python</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">-*- coding: utf-8 -*-</span>

<span style="color: #0000FF;">if</span> __name__ == <span style="color: #008000;">'__main__'</span>
        print <span style="color: #008000;">'OK!'</span>
$ pyflakes 2016-03-29-180555.py
2016-03-29-180555.py:4:26: invalid syntax
<span style="color: #0000FF;">if</span> __name__ == <span style="color: #008000;">'__main__'</span>
                         ^
$ cat 2016-03-29-180555.py
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/env python</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">-*- coding: utf-8 -*-</span>

<span style="color: #0000FF;">if</span> __name__ == <span style="color: #008000;">'__main__'</span>:
        print <span style="color: #008000;">'OK!'</span>
$ pyflakes 2016-03-29-180555.py
$ python 2016-03-29-180555.py
OK!
</pre>
</div>

<p>
pyflakes を emacs から使うために、以下のように設定する。
</p>
<pre class="example">
M-x package-install RET flymake RET
M-x package-install RET flymake-python-pyflakes RET 
M-x package-install RET flymake-cursor RET 
</pre>
<p>
init.el は以下のようにする。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">flymake-python-pyflakes</span>)
(<span style="color: #0000FF;">require</span> '<span style="color: #D0372D;">flymake-cursor</span>)
(add-hook 'python-mode-hook 'flymake-python-pyflakes-load)
</pre>
</div>

<p>
flymake-python-pyflakes および flymake-cursor の使い方は、例えば、以下のようなファイルで、
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/</span><span style="color: #0000FF;">env</span><span style="color: #8D8D84; font-style: italic;"> python</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">-*- coding: utf-8 -*-</span>

<span style="color: #0000FF;">if</span> __name__ == <span style="color: #008000;">'__main__'</span>
        print <span style="color: #008000;">'OK!'</span>
</pre>
</div>
<p>
if の行にカーソルがくると、ミニバッファに以下のように表示される。
</p>
<pre class="example">
invalid syntax
</pre>
</div>
</div>

<div id="outline-container-orgac32bae" class="outline-2">
<h2 id="orgac32bae"><span class="section-number-2">8</span> jedi</h2>
<div class="outline-text-2" id="text-8">
<p>
python でのかしこい補完機能<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install epc jedi
</pre>
</div>
<p>
emacs から利用するために、以下を設定する。
</p>
<pre class="example">
M-x package-install RET jedi RET
</pre>
<p>
init.el は以下のとおり。
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'python-mode-hook 'jedi:setup)
(<span style="color: #0000FF;">setq</span> jedi:complete-on-dot t)
</pre>
</div>
<p>
上記を設定後、M-x jedi:install-server とすると設定が終る。
</p>

<p>
使い方は .py ファイルを開いて、例えば、impo まで書くと補完候補が表示される。
</p>
</div>
</div>

<div id="outline-container-org43ec511" class="outline-2">
<h2 id="org43ec511"><span class="section-number-2">9</span> 参考</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="http://qiita.com/kunst1080/items/8349ad2d3bbe808651d1">Cygwin 環境に virtualenv を入れてみた - Qiita</a></li>
<li><a href="http://qiita.com/caad1229/items/325ca5c8ad198b0ebce7">virtualenv で python 環境を管理する - Qiita</a></li>
<li><a href="http://chiranoura.nobody.jp/articles/2014-03-04_01_how_to_install_pip_and_setuptools/">ちらのうら - Cygwin 上で pip と setuptools をインストールする方法</a></li>
<li><a href="http://futurismo.biz/archives/2680">Emacs で Python 開発環境を構築 | Futurismo</a></li>
<li><a href="https://www.emacswiki.org/emacs/PythonProgrammingInEmacs">EmacsWiki: Python Programming In Emacs</a></li>
<li><a href="http://qiita.com/ynakayama/items/8616f4c0c6e372de9a42">Python のコーディング規約 PEP8 に準拠する - Qiita</a></li>
<li><a href="http://tkf.github.io/emacs-jedi/latest/">Jedi.el - Python auto-completion for Emacs — Emacs Jedi 0.2.0alpha2 documentation</a></li>
<li><a href="http://yukke.hateblo.jp/entry/2015/01/09/222311">emacs+pyflakes+flymake で python の構文チェックを勝手にしてもらう - yukke::note</a></li>
<li><a href="http://hiroom2.jimdo.com/2015/09/18/emacs%E3%81%AEflymake%E3%83%91%E3%83%83%E3%82%B1%E3%83%BC%E3%82%B8%E3%81%AE%E4%BD%BF%E3%81%84%E6%96%B9/">emacs の flymake パッケージの使い方 - Narrow Escape</a></li>
<li><a href="http://www.yunabe.jp/docs/python_package_management.html">Python パッケージ管理技術まとめ (pip, setuptools, easy<sub>install</sub>, etc)</a></li>
<li><a href="http://pep8-ja.readthedocs.org/ja/latest/">はじめに — pep8-ja 1.0 ドキュメント</a></li>
<li><a href="http://qiita.com/kitsuyui/items/5ab4608003a29ff7689f">Python の Lint (文法チェッカ) まとめ - flake8 + hacking を使う - - Qiita</a></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
表示されるまで、くっそ重い。。。。
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
auto-complete と同時設定するとうまく効かなかった。
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2020-09-17 Thu 12:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
